#Generated by IBM Globalization
#Tue Apr 28 13:07:42 UTC 2015
CACHE_DESC=Si fausses couches en cache ne sera utilis\u00E9 lors de la cr\u00E9ation de l'image.   Cela entra\u00EEnera des temps de g\u00E9n\u00E9ration plus lente, mais est n\u00E9cessaire si on est une couche qui n'a pas chang\u00E9, mais doit aller et extraire le contenu. 
ExtDesc=G\u00E9n\u00E9rez une image Docker \u00E0 partir d'un Dockerfile \u00E0 l'aide de l'IBM Continer Service de g\u00E9n\u00E9ration de service sur Bluemix et poussez que 
ExtMessage=(B\u00EAta) Pour optimiser cette extension vous devez \u00EAtre activ\u00E9 pour le service de conteneur IBM sur Bluemix.  Vous pouvez v\u00E9rifier cela en signant dans  <a href\="https\://console.ng.bluemix.net/"> Bluemix </a>, et en s\u00E9lectionnant 'Cr\u00E9er un conteneur'.   Informations sur l'extension peut \u00EAtre trouv\u00E9e sur  <a href\="https\://developer.ibm.com/bluemix/docs/set-up-continuous-delivery-ibm-containers/"> IBM Bluemix Dev </a> <br> <br> Modifications r\u00E9centes\: g\u00E9n\u00E9ration de conteneur pipeline sera d\u00E9sormais nettoyer les images anciennes inutilis\u00E9es avant de construire, si on sera plus de copies IMAGE_LIMIT (par d\u00E9faut 5) apr\u00E8s cette g\u00E9n\u00E9ration.   Si vous ne souhaitez pas ce comportement, d\u00E9finissez-le \u00E0 -1 dans les variables d'environnement pour la configuration de l'\u00E9tape de g\u00E9n\u00E9ration.
IMAGE_NAME_DESC=Le nom de base de l'image Docker \u00E0 cr\u00E9er.   Il sera utilis\u00E9 pour le nom de l'image cr\u00E9\u00E9e dans le registre, et dans les noms de tous les conteneurs.   Il peut \u00EAtre d\u00E9fini sur le travail ou comme une propri\u00E9t\u00E9 envrironment sur l'\u00E9tape. 
COMMAND_KEY=Script de g\u00E9n\u00E9ration 
COMMAND_DESC=Exemple de script pour g\u00E9n\u00E9rer une image Docker du service de conteneur IBM.   Utilisez ce qu'est, ou le mettre \u00E0 jour en fonction de vos besoins. 
CACHE_KEY=Utilisez les couches en cache
IMAGE_NAME_KEY=Nom de l'image 
ExtName=Conteneur IBM Service sur Bluemix
